[
  {
    "id": "gs_trailofbits_vechainthor_TOB-VECHAIN-THOR-1",
    "subset": "gold_standard",
    "language": "golang",
    "chain": "other",
    "source_platform": "trailofbits",
    "source_report": "VeChain - VeChainThor Hayabusa Upgrade Security Assessment October 17, 2025",
    "source_finding_id": "TOB-VECHAIN-THOR-1",
    "report_url": "https://github.com/trailofbits/publications/blob/master/reviews/2025-10-vechain-vechainthorhayabusaupgrade-securityreview.pdf",
    "github_repo_url": "https://github.com/vechain/thor",
    "contest_date": "2025-09-15",
    "severity": "high",
    "vulnerability_type": "broken_invariant",
    "difficulty_tier": 2,
    "context_level": "multi_file",
    "finding_title": "Staker contract balance invariant can be broken using SELFDESTRUCT",
    "finding_description": "VeChain DPoS uses a Staker contract to handle validations and delegations. One of the system’s invariants requires that the total amount of staked VET matches the Staker contract balance. Even though the contract prevents VET from being received via normal transfers, an attacker can still send VET to the contract via SELFDESTRUCT. This can break two assumptions: the first one is that the amount of VET transferred to the contract is always an integer, and the second is that all VET in the contract comes from a stake or delegation operation.",
    "attack_scenario": "1. Mallory develops and funds a contract with more than 1 VET.\n2. The contract calls SELFDESTRUCT, forcibly sending its VET balance to the Staker contract.\n3. The Staker contract's balance now exceeds the internally tracked total stake.\n4. The ContractBalanceCheck() invariant, which is checked during housekeeping and block validation, fails.\n5. This failure prevents the PoA to DPoS transition from completing and halts block production, causing a denial of service.",
    "fix_description": "Short term, track the Staker contract’s VET balance using an additional storage variable that is updated only on direct calls to the smart contract. Direct transfers and airdrops should not affect this variable. Long term, do not rely on contract balances, as they can be altered. Improve the test suite to consider adversarial cases. Additionally, consider reducing the reliance on the contract balance check on critical code paths (e.g., block validation), since this opens up a significant DoS attack vector.",
    "primary_file": {
      "path": "builtin/staker/housekeep.go",
      "content": "func (s *Staker) ContractBalanceCheck(pendingWithdraw uint64) error {\n[...]\n// Get the staker contract's balance\nstakerAddr := s.Address()\nbalance, err := s.state.GetBalance(stakerAddr)\nif err != nil {\nreturn err\n}\nbalanceVET := ToVET(balance)\ntotal := uint64(0)\nfor _, stake := range []uint64{lockedStake, queuedStake, withdrawableStake,\ncooldownStake, pendingWithdraw} {\npartialSum, overflow := math.SafeAdd(total, stake)\nif overflow {\nreturn fmt.Errorf(\n"total overflow occurred while adding locked(%d) + queued(%d) + withdrawable(%d) + cooldown(%d) + pendingWithdraw(%d)",\nlockedStake,\nqueuedStake,\nwithdrawableStake,\ncooldownStake,\npendingWithdraw,\n)\n}\ntotal = partialSum\n}\nif balanceVET != total {\nlogger.Error(\"sanity check failed\",\n"locked", lockedStake,\n"queued", queuedStake,\n"withdrawable", withdrawableStake,\n"cooldown", cooldownStake,\n"pendingWithdraw", pendingWithdraw,\n"total", total,\n"balance", balanceVET,\n)\nreturn fmt.Errorf(\n"sanity check failed: locked(%d) + queued(%d) + withdrawable(%d) = %d, but account balance is %d, diff= %d",\nlockedStake,\nqueuedStake,\nwithdrawableStake,\ntotal,\nbalanceVET,\nbalanceVET-total,\n)\n}\nreturn nil\n}",
      "vulnerable_lines": [262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324],
      "vulnerable_functions": ["ContractBalanceCheck"]
    },
    "context_files": [],
    "call_flow": "Attacker.SELFDESTRUCT -> StakerContract.balance increases -> VeChainThorNode.housekeeping -> Staker.ContractBalanceCheck() -> invariant check fails -> chain halt / DoS",
    "context_hint": "The core issue is relying on `address(this).balance` as a source of truth for internal accounting. In EVM-like chains, this invariant is easily broken because anyone can forcibly send native currency to any address using `SELFDESTRUCT`. The check `balanceVET != total` fails, causing critical operations like housekeeping and block validation to revert, leading to a system-wide denial of service.",
    "is_vulnerable": true,
    "expert_notes": "This is a classic vulnerability pattern. It highlights the danger of mixing accounting logic with native balance properties. The correct pattern is to maintain an internal bookkeeping variable (e.g., `totalStaked`) that is only updated through explicit function calls (`stake()`, `unstake()`) and is never derived from `address(this).balance`."
  },
  {
    "id": "gs_trailofbits_vechainthor_TOB-VECHAIN-THOR-2",
    "subset": "gold_standard",
    "language": "solidity",
    "chain": "other",
    "source_platform": "trailofbits",
    "source_report": "VeChain - VeChainThor Hayabusa Upgrade Security Assessment October 17, 2025",
    "source_finding_id": "TOB-VECHAIN-THOR-2",
    "report_url": "https://github.com/trailofbits/publications/blob/master/reviews/2025-10-vechain-vechainthorhayabusaupgrade-securityreview.pdf",
    "github_repo_url": "https://github.com/vechain/thor",
    "contest_date": "2025-09-15",
    "severity": "high",
    "vulnerability_type": "centralization",
    "difficulty_tier": 4,
    "context_level": "cross_contract",
    "finding_title": "DPoS is vulnerable to significant centralization risk",
    "finding_description": "DPoS systems like VeChain are susceptible to centralization risks due to the formation of a plutocracy that governs a large majority of the total stake and voting power. More specifically, there is historical precedence of DPoS systems being vulnerable to vote buying and bribery attacks. In VeChain, the validators that have the highest total stakes have the highest likelihood of proposing the next block. This will naturally incentivize delegators to bond to those validators since this will increase their likelihood of receiving VTHO rewards. More importantly, larger validators can also offer kickbacks or bribes to delegators (outside of the 70% delegation reward) to further incentivize delegators to bond to them. Over time, this will create a concentrated group of validators that reach the maximum stake possible of 600M VET. At the same time, there will be a group of validators with insufficient stake that are unlikely to propose blocks and will choose to exit the network. As soon as these validators exit the network, the validators with the largest stakes are economically incentivized to spin up new validators and participate in the protocol. The FIFO activation queue is ineffective against a Sybil attack if the total stake gets concentrated into the hands of a few validators and pushes other, smaller validators to exit the network. It is important to note that under PoA, there is no economic incentive to act maliciously and form a plutocracy of the largest stakeholders. With the migration to DPoS, the original PoA validator set is economically incentivized to push out other validators by accruing as much stake as possible and then activating new validators under different identities to capture an even larger portion of the total stake.",
    "attack_scenario": "1. Large validators offer kickbacks/bribes to delegators to attract more stake.\n2. Delegators flock to the largest validators to maximize rewards.\n3. Stake becomes concentrated in a few validators, forming a cartel.\n4. Smaller validators become unprofitable and exit the network.\n5. The validator cartel uses its concentrated stake to launch Sybil attacks, activating new validators they control to capture even more of the total stake.\n6. The network becomes highly centralized, undermining the security and decentralization promises of the DPoS mechanism.",
    "fix_description": "Long term, consider migrating to a variant of PoS, such as nominated PoS (NPoS) or a pure PoS mechanism like Ethereum. It is important to note that there are no production-grade DPoS systems that have implemented any mitigations that would prevent cartel formation and the concentration of stake.",
    "primary_file": {
      "path": "N/A",
      "content": "N/A",
      "vulnerable_lines": [],
      "vulnerable_functions": []
    },
    "context_files": [],
    "call_flow": "N/A",
    "context_hint": "This is a well-known game-theoretic vulnerability in DPoS systems. The 'rich get richer' dynamic is inherent. Validators with more stake are chosen more often, earn more rewards, and can offer better returns to delegators, creating a positive feedback loop that leads to stake centralization. This isn't a bug in the code, but a fundamental flaw in the economic model of the consensus mechanism.",
    "is_vulnerable": true,
    "expert_notes": "The report correctly identifies the core centralizing force in DPoS. While technically 'working as designed', the design itself promotes oligarchy. The recommendation to explore NPoS (like Polkadot) or pure PoS (like Ethereum) is sound, as these systems have mechanisms (e.g., Phragmén's algorithm in NPoS, random sampling in PoS) designed to combat this type of stake concentration."
  },
  {
    "id": "gs_trailofbits_vechainthor_TOB-VECHAIN-THOR-3",
    "subset": "gold_standard",
    "language": "solidity",
    "chain": "other",
    "source_platform": "trailofbits",
    "source_report": "VeChain - VeChainThor Hayabusa Upgrade Security Assessment October 17, 2025",
    "source_finding_id": "3",
    "report_url": "https://github.com/trailofbits/publications/blob/master/reviews/2025-10-vechain-vechainthorhayabusaupgrade-securityreview.pdf",
    "github_repo_url": "https://github.com/vechain/thor",
    "contest_date": "2025-09-15",
    "severity": "medium",
    "vulnerability_type": "Configuration",
    "difficulty_tier": 1,
    "context_level": "single_file",
    "finding_title": "Short cooldown and short staking cycles increase validator churn",
    "finding_description": "A short cooldown period and short staking cycles increases validator churn and reduces long-term economic commitment to the ecosystem. In general, the validators should experience friction when trying to exit and re-enter the system.",
    "attack_scenario": "Low economic friction allows for 'drive-by' validation. Validators can quickly enter, participate for a short period to extract immediate rewards or exploit short-term opportunities, and then exit with minimal penalty or delay. This reduces the overall economic security of the network as there is no strong incentive for long-term commitment and alignment with the network's health.",
    "fix_description": "Increase cooldown period and staking cycles lengths.",
    "primary_file": {
      "path": "N/A",
      "content": "N/A",
      "vulnerable_lines": [],
      "vulnerable_functions": []
    },
    "context_files": [],
    "call_flow": "N/A",
    "context_hint": "This is an economic security parameter tuning issue. The 'cooldown' period acts as an unbonding period in other PoS systems. If it's too short, the cost of validator misbehavior or abandonment is low. Longer cooldowns force validators to have more 'skin in the game' for a longer duration, improving network stability.",
    "is_vulnerable": true,
    "expert_notes": "The severity is informational because it's not a direct exploit, but it weakens the economic guarantees of the protocol. Optimal values for these parameters are a trade-off between security (long periods) and liquidity/flexibility for stakers (short periods). The recommendation points towards favoring security."
  }
]